app/controllers/item_controller.rb

INSERT INTO "items" ("kit_id", "name", "quantity", "merchant_url", "price", "notes", "created_at", "updated_at") VALUES (980190964, 'foo', 1, 'bar', 0.0, '...', '2011-11-14 13:15:33.146054', '2011-11-14 13:15:33.146054') RETURNING "id"
---
  def create
    user = User.where("username = ?", params[:username]).first

    if (user == nil)
      render :json => { :success => false, :message => "User couldn't be found" }
    else
      kit = Kit.where("slug = ? AND user_id = ? AND token = ?", params[:slug].downcase, user.id, params[:token]).first

      if (kit == nil)
        render :json => { :success => false, :message => "Kit couldn't be found." }
      else
        item = Item.new
        item.kit_id = kit.id
        item.name = params[:name]
        item.quantity = params[:quantity].to_i
        item.merchant_url = params[:merchant_url]
        item.price = params[:price].to_f
        item.notes = params[:notes]

        item.save

SELECT "items".* FROM "items" WHERE "items"."id" = 980190967 LIMIT 1
DELETE FROM "items" WHERE "items"."id" = 980190967
---
  def destroy
    resp = { :success => false, :message => "Something went wrong." }

    user = User.where("username = ?", params[:username]).first

    if (user == nil)
      resp[:message] = "User couldn't be found"
    else
      kit = Kit.where("slug = ? AND user_id = ? AND token = ?", params[:slug].downcase, user.id, params[:token]).first

      if(kit == nil)
        resp[:message] = "Kit couldn't be found."
      else
        item = Item.find(params[:id])

        if (item == nil)
          resp[:message] = "Item couldn't be found."
        else
          item.delete