app/controllers/kit_controller.rb

SELECT "kits".* FROM "kits" WHERE (slug = 'my-first-kit-2') LIMIT 1
SELECT "items".* FROM "items" WHERE (kit_id = 2)
---
  def index
    @banner = "Better Bill of Materials";

    @user = User.where("username = ?", params[:username]).first

    if (@user == nil)
      render "notfound"
    else
      @kit = Kit.where("slug = ?", params[:slug].downcase).first

      if (@kit == nil)
        render "notfound"
      else
        @editable = params[:token] != nil && params[:token] == @kit.token

        if(!@editable)
          @kit.token = ''
        end

        @items = Item.where("kit_id = ?", @kit.id)

INSERT INTO "kits" ("title", "token", "slug", "created_at", "updated_at") VALUES ('my first kit', 'CL6SzRZ9', NULL, '2011-11-13 16:50:49.605954', '2011-11-13 16:50:49.605954') RETURNING "id"
---
  def create
    if (params[:title] != nil)
      user_id = nil
      username = ''
      if(cookies[:username] != nil)
        user = User.where("username = ?", cookies[:username]).first
        if(user != nil)
          user_id = user.id
          username = user.username
        end
      end

      if(user_id == nil)
        user = User.new
        user.username = User.generate_unique_username
        user.save
        user_id = user.id
        cookies[:username] = { :value => user.username, :expires => 1.year.from_now }
        username = user.username
      end

      kit = Kit.new
      kit.title = params[:title]
      kit.user_id = user_id
      kit.token = Kit.generate_unique_token!
      kit.generate_slug
      kit.save